Тест_ЗУП_31_КОРП/src/Documents/ПланПоказателейЭффективностиПозиции/ПланПоказателейЭффективностиПозиции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланПоказателейЭффективностиПозиции</name>
  <registerRecords>InformationRegister.ПлановыеЗначенияПоказателейЭффективностиПозиций</registerRecords>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказателиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.СтруктураЦелей</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяЭффективности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Documents/ПланПоказателейЭффективностиПозиции/Forms/ФормаДокумента/Module.bsl
#Область ОбработкаСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗначенияДляЗаполнения = Новый Структура("Ответственный, Месяц", "Объект.Ответственный", "Объект.Период");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
		
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПриПолученииДанныхНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриПолученииДанныхНаСервере();
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ПланПоказателейЭффективностиПозиции");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	УстановитьПараметрыВыбораПозиции();
КонецПроцедуры

&НаКлиенте
Процедура ПозицияПриИзменении(Элемент)
	ЗаполнитьПоказателиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	КлючевыеПоказателиЭффективностиКлиентСервер.ЗаполнитьВторичныеРеквизитыСтрокиПоказателя(ЭтаФорма, Элемент.ТекущиеДанные);
	
КонецПроцедуры

#Область МесяцСтрокой

&НаКлиенте
Процедура МесяцСтрокойПриИзменении(Элемент)
	МесяцСтрокойПриИзмененииНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.Период", "МесяцСтрокой",, Новый ОписаниеОповещения("МесяцСтрокойПриИзмененииНаКлиенте", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Объект.Период", "МесяцСтрокой", Направление);
	МесяцСтрокойПриИзмененииНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоказатели(Команда)
	ЗаполнитьПоказателиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	ЗаполнитьВторичныеРеквизитыФормы();
	
	УстановитьСвойстваЭлементовФормы();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВторичныеРеквизитыФормы()
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.Период", "МесяцСтрокой");
	
	ЗаполнитьТаблицуПоказателей();
	КлючевыеПоказателиЭффективностиФормы.УстановитьПараметрыОтбораПоказателям(ЭтаФорма);
	КлючевыеПоказателиЭффективностиФормы.ЗаполнитьВторичныеРеквизитыТаблицыПоказателей(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()
	УстановитьПараметрыВыбораПозиции();
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойПриИзмененииНаКлиенте(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	МесяцСтрокойПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура МесяцСтрокойПриИзмененииНаСервере()
	ЗаполнитьПоказателиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиНаСервере()
	
	ЗаполнитьТаблицуПоказателей();
	
	КлючевыеПоказателиЭффективностиФормы.УстановитьПараметрыОтбораПоказателям(ЭтаФорма);
	КлючевыеПоказателиЭффективностиФормы.ЗагрузитьПоказатели(ЭтаФорма);
	КлючевыеПоказателиЭффективностиФормы.ЗаполнитьВторичныеРеквизитыТаблицыПоказателей(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПоказателей()
	
	ПоказателиПозиции = КлючевыеПоказателиЭффективности.ПоказателиПозиции(Объект.Позиция, Объект.Период);
	
	Если ПоказателиПозиции = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПлановыеПоказателиПозиции = ПоказателиПозиции.Скопировать(Новый Структура("ТребуетсяВводПлана", Истина));
	
	КлючевыеПоказателиЭффективностиФормы.ЗаполнитьСоответствиеПоказателей(ЭтаФорма, ПлановыеПоказателиПозиции);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораПозиции()
	КлючевыеПоказателиЭффективностиФормы.УстановитьПараметрыВыбораЭлементаПоМестуВСтруктуреПредприятия(Элементы.Позиция, Объект.Подразделение);
КонецПроцедуры

#КонецОбласти
